[
  {
    "id": 1,
    "slug": "exoplanetas-clasificacion-avanzada",
    "title": "ExoPlanetas: Clasificación Avanzada",
    "shortDescription": "Solución de IA para clasificación de exoplanetas, desarrollada para el NASA Space Apps Challenge 2025.",
    "longDescription": "Proyecto de inteligencia artificial que utiliza aprendizaje automático para clasificar exoplanetas basándose en datos de la NASA. Desarrollado como parte del NASA Space Apps Challenge 2025, donde logramos clasificarnos en el TOP 5 de la competencia. La solución implementa algoritmos de clasificación avanzados y procesamiento de señales astronómicas.",
    "technologies": ["Python", "NumPy", "Pandas", "Scikit-learn", "FastApi"],
    "year": 2025,
    "status": "Completado",
    "demo": "https://interspace.com.ar/",
    "code": "https://github.com/DenisPablo/ExoPlanetas",
    "features": [
      "Clasificación automática de exoplanetas",
      "Análisis de datos astronómicos",
      "Interfaz de usuario intuitiva",
      "Alta precisión en la detección"
    ],
    "highlights": [
      "Clasificado en el TOP 5 del NASA Space Apps Challenge 2025",
      "Implementación de algoritmos avanzados de machine learning"
    ],
    "image": "image/exoplanetas.png"
  },
  {
    "id": 2,
    "slug": "sistema-de-gestion-para-academias-de-bjj",
    "title": "Sistema de Gestión para Academias de BJJ",
    "shortDescription": "Plataforma integral para la gestión de academias de Brazilian Jiu-Jitsu.",
    "longDescription": "Sistema web completo para la administración de academias de Jiu-Jitsu Brasileño. Incluye módulos para gestión de alumnos, control de asistencia, seguimiento de pagos, programación de clases y más. Desarrollado con Django en el backend y tecnologías modernas en el frontend para una experiencia de usuario óptima.",
    "technologies": [
      "Python",
      "Django",
      "PostgreSQL",
      "JavaScript",
      "Bootstrap"
    ],
    "year": 2025,
    "status": "En desarrollo",
    "demo": "#",
    "code": "https://github.com/DenisPablo/GestionTickets",
    "features": [
      "Gestión de alumnos y profesores",
      "Control de asistencia con QR",
      "Calendario de clases",
      "Seguimiento de progreso de alumnos",
      "Gamificación de los alumnos"
    ],
    "highlights": [
      "Sistema de control de asistencia innovador con códigos QR",
      "Interfaz intuitiva para seguimiento del progreso de los alumnos"
    ],
    "image": "image/bjj_academy.png"
  },
  {
    "id": 3,
    "slug": "sistema-de-gestion-de-entradas-y-tickets",
    "title": "Sistema de Gestión de Entradas y Tickets",
    "shortDescription": "Plataforma segura para la venta y validación de entradas con códigos QR únicos y verificación en tiempo real.",
    "longDescription": "Sistema integral de gestión de entradas que garantiza la máxima seguridad en la venta y validación de tickets. Desarrollado con tecnologías modernas, ofrece un sistema antifraude mediante códigos QR únicos con firmas digitales, verificación en tiempo real y control de acceso detallado. La plataforma está diseñada para manejar grandes volúmenes de ventas y validaciones de manera eficiente, asegurando una experiencia fluida tanto para organizadores como para asistentes.",
    "technologies": ["Python", "FastApi", "PostgreSQL", "MercadoPago API"],
    "year": 2025,
    "status": "En desarrollo",
    "demo": "#",
    "code": "https://github.com/DenisPablo/GestionTickets",
    "features": [
      "Sistema antifraude con códigos QR únicos y firmas digitales",
      "Integración con MercadoPago para pagos seguros",
      "Panel de administración completo para gestión de eventos",
      "Control de acceso con diferentes niveles de permisos",
      "Escalable para manejar grandes volúmenes de usuarios",
      "Verificación de tickets en tiempo real",
      "Reportes y estadísticas de ventas y asistencia"
    ],
    "highlights": [
      "Sistema de verificación de tickets imposible de falsificar",
      "Interfaz intuitiva para organizadores y asistentes",
      "Alta disponibilidad y rendimiento optimizado"
    ],
    "image": "image/sistema_tickets.png"
  },
  {
    "id": 4,
    "slug": "portfolio-&-cms-personal",
    "title": "Portfolio & CMS Personal",
    "shortDescription": "Sistema de Gestión de Contenidos (CMS) y Portafolio web dinámico para desarrolladores y profesionales.",
    "longDescription": "Plataforma integral que combina un CMS robusto con un portafolio web profesional. Permite gestionar y exhibir proyectos, habilidades y CV de manera dinámica y segura. Desarrollado con tecnologías modernas para ofrecer un rendimiento óptimo y una experiencia de usuario excepcional tanto para administradores como visitantes.",
    "technologies": [
      "C#",
      "ASP.NET Core",
      "Entity Framework Core",
      "SQL Server",
      "JavaScript",
      "TinyMCE",
      "Cloudinary",
      "Bootstrap",
      "jQuery",
      "Docker"
    ],
    "year": 2024,
    "status": "Completado",
    "demo": "#",
    "code": "https://github.com/DenisPablo/Portafolio",
    "features": [
      "Panel de administración completo para gestión de contenido",
      "Editor de texto enriquecido con TinyMCE",
      "Almacenamiento en la nube con integración de Cloudinary",
      "Sistema de autenticación y autorización robusto",
      "Gestión de proyectos con categorías y etiquetas",
      "Sistema de papelera con Soft Delete",
      "Interfaz de usuario moderna y responsiva",
      "Sección de CV profesional descargable",
      "Galería de proyectos con filtros por categorías"
    ],
    "highlights": [
      "Arquitectura modular y escalable",
      "Implementación de patrones de diseño modernos",
      "Alta seguridad con protección contra ataques comunes",
      "Diseño responsivo que se adapta a cualquier dispositivo"
    ],
    "image": "image/portfolio_cms_personal.png"
  }
]
